---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneId.#ctor(System.Guid)
source: html/db30aa2e-ed80-2a06-d571-e0ed8ccf7a75.htm
---
# Autodesk.Revit.UI.DockablePaneId.#ctor Method

Creates a new DockablePaneId instance.

## Syntax (C#)
```csharp
public DockablePaneId(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the DockablePaneId.